// У нас есть следующий объект:
// Проверьте, что этот объект не пустой 

// let user = {
//   name: "John",
//   age: 30
// };

// if(Object.keys(user)==0){
//   console.log("Объект пуст")
// }else{
//   console.log('Объект не пуст')
// }


// Проверить что объект Является  массивом 
// let arr = [1,2,3,4];
// console.log(Array.isArray(arr));


//Получите из этого массива объект, где name == "Bob" и сохраните это в какой-либо переменной.
//Удалите из массива объектов (задание 2) объект с name == "Anna".

// let user = [
// {
//   name: "John",
//   age: 30
// },
// {
//   name: "Bob",
//   age: 21
// },
// {
//   name: "Anna",
//   age: 19
// }
// ]
// let arr = user[1];
// // console.log(arr);
// user.splice(2);
// // console.log(user);
// user.sort(function(prev,next){
//      if(prev.age<next.age) return -1;     
//      });
// console.log(user);




//Получите из объекта obj значение id в константу id не используя выражение obj.id
// const obj = {
//                 id: 5,
//                 token: 12343423
//             };

// const {id} = obj;
// console.log(id);


//Получите из объекта obj значение id и разместите его в константу userId.

// const obj = {
//                 id: 5,
//                 token: 12343423
//             };
// const userId = obj.id;
// console.log(userId);

// const {id : userId} = obj;
// console.log(userId);



// Задача в том, чтобы создать небольшую программу, которая будет переводить гривны в доллары. 
// Должен получиться символический "обменный пункт". 

// После загрузки страницы пользователю предлагается ввести количество гривны, 
// которые он бы хотел обменять на доллары.
// Пользователь вводит количество гривны и ему выходит сообщение, сколько долларов ему полагается.

// Если количество гривны более 10 000, то человеку предлагается скидка в 10%.

// Если количество гривны более 20 000, то человеку предлагается скидка в размере 20%.

// В итоговое сообщение после обмена нужно включить сообщение, что вам предоставлена скидка в таком-то размере.

// let userMoney = prompt('Введите сколько гривен Вы хотите поменять на доллары');
// let result = userMoney*30;

//  if(result>10000 && result<=20000){
//     alert('Ваша сумма составялет' + " " + result + " " + 'гривен' + " " + 'скидка 10%');
// }
// else if(result>20000){
//   alert('Ваша сумма составялет' + " " + result + " " + 'гривен' + " " +'скидка 20%');
// }

// else{
//   alert('Ваша сумма составялет' + " " + result + " " + 'гривен');
// }
